app/Controllers/admin.php

    public function index()
    {
        $this->checkAdmin();

        $userModel = new UserModel();
        $arbolModel = new ArbolModel();
        $actualizacionModel = new ActualizacionModel();
        $especieModel = new EspecieModel();

        $tab = $this->request->getGet('tab') ?? 'actualizacion';
        $arbol_id = $this->request->getGet('arbol_id'); // ID del árbol seleccionado

        $arboles = $arbolModel->findAll(); // Obtener todos los árboles
        $especies = $especieModel->findAll(); // Obtener todas las especies
        $arbol = null; // Inicializar como null para evitar errores si no hay árbol seleccionado
        $historial = [];

        if ($tab === 'historial' && $arbol_id) {
            $arbol = $arbolModel->find($arbol_id); // Obtener los detalles del árbol seleccionado
            if ($arbol) {
                $historial = $actualizacionModel->obtenerActualizacionesPorArbol($arbol_id); // Historial del árbol
            }
        }

        $data = [
            'totalAmigos' => $userModel->countAmigos(),
            'totalArbolesDisponibles' => $arbolModel->countArbolesDisponibles(),
            'totalArbolesVendidos' => $arbolModel->countArbolesVendidos(),
            'tab' => $tab,
            'arboles' => $arboles,
            'especies' => $especies,
            'arbol' => $arbol, // Enviar el árbol seleccionado o null
            'historial' => $historial, // Historial de actualizaciones del árbol seleccionado
        ];
---
SELECT *
FROM `arboles`
WHERE `arboles`.`id` = '2'