app/Controllers/admin.php

SELECT *
FROM `especies`
SELECT COUNT(*) AS `numrows`
FROM `arboles`
WHERE `estado` = 'Disponible'
SELECT *
FROM `usuarios`
SELECT *
FROM `arboles`
---
    public function index()
    {
        $this->checkAdmin();

        $userModel = new UserModel();
        $arbolModel = new ArbolModel();
        $especieModel = new EspecieModel();

        $tab = $this->request->getGet('tab') ?? 'especies';

        $especies = $especieModel->findAll();
        $usuarios = $userModel->findAll();
        $amigos = $userModel->obtenerAmigos();

        // Inicializa datos específicos
        $totalArbolesDisponibles = $arbolModel->where('estado', 'Disponible')->countAllResults();
        $totalArbolesVendidos = $arbolModel->where('estado', 'Vendido')->countAllResults();

        $data = [
            'totalAmigos' => $userModel->countAmigos(),
            'totalArbolesDisponibles' => $totalArbolesDisponibles,
            'totalArbolesVendidos' => $totalArbolesVendidos,
            'especies' => $especies,
            'arboles' => [], // Inicializa como vacío
            'amigos' => $amigos,
            'usuarios' => $usuarios,
            'tab' => $tab,
            'mensaje' => session()->getFlashdata('mensaje'),
            'error' => session()->getFlashdata('error'),
        ];