app/Controllers/amigo.php

SELECT *
FROM `amigo_arbol`
WHERE `amigo_id` = '2'
AND `arbol_id` = '2'
SELECT *
FROM `actualizaciones`
WHERE `arbol_id` = '2'
---
    public function actualizaciones($arbolId)
    {
        $session = session();

        // Verificar si el usuario tiene el rol 'Amigo'
        if ($session->get('rol') !== 'Amigo') {
            return redirect()->to('/')->with('error', 'Acceso no autorizado.');
        }

        $usuarioId = $session->get('usuario_id');

        // Cargar el modelo
        $amigoArbolModel = new AmigoArbolModel();
        $db = \Config\Database::connect();

        // Verificar que el árbol pertenece al usuario
        $builder = $db->table('amigo_arbol');
        $builder->where('amigo_id', $usuarioId);
        $builder->where('arbol_id', $arbolId);
        $result = $builder->get()->getRowArray();

        if (!$result) {
            return redirect()->to('/amigo')->with('error', 'No tienes acceso a este árbol.');
        }

        // Obtener las actualizaciones del árbol
        $builder = $db->table('actualizaciones');
        $builder->where('arbol_id', $arbolId);
        $actualizaciones = $builder->get()->getResultArray();