app/Controllers/Operador.php

SELECT *
FROM `arboles`
---
    public function index()
    {
        $this->checkOperator();

        $userModel = new UserModel();
        $arbolModel = new ArbolModel();
        $actualizacionModel = new ActualizacionModel();

        $tab = $this->request->getGet('tab') ?? 'actualizacion';
        $arbol_id = $this->request->getGet('arbol_id'); // ID del árbol seleccionado

        $arboles = $arbolModel->findAll();
        $arbol = null;
        $historial = [];

        if ($tab === 'historial' && $arbol_id) {
            $arbol = $arbolModel->find($arbol_id); // Obtener los detalles del árbol
            if ($arbol) {
                $historial = $actualizacionModel->obtenerActualizacionesPorArbol($arbol_id);
            }
        }

        $data = [
            'totalAmigos' => $userModel->countAmigos(),
            'totalArbolesDisponibles' => $arbolModel->countArbolesDisponibles(),
            'tab' => $tab,
            'arboles' => $arboles,
            'arbol' => $arbol, // Enviar el árbol seleccionado
            'historial' => $historial, // Historial de actualizaciones del árbol seleccionado
        ];