app/Models/AmigoArbolModel.php

SELECT `arboles`.*, `especies`.`nombre_comercial`, `especies`.`nombre_cientifico`
FROM `arboles`
JOIN `especies` ON `arboles`.`especie_id` = `especies`.`id`
WHERE `arboles`.`id` = '1'
---
    public function obtenerArbolPorId($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('arboles');
        $builder->select('arboles.*, especies.nombre_comercial, especies.nombre_cientifico');
        $builder->join('especies', 'arboles.especie_id = especies.id');
        $builder->where('arboles.id', $id);

        return $builder->get()->getRowArray(); // Recupera un solo resultado como array

INSERT INTO `amigo_arbol` (`amigo_id`, `arbol_id`) VALUES ('2', '5')
---
    public function registrarCompra($amigoId, $arbolId)
    {
        return $this->insert([
            'amigo_id' => $amigoId,
            'arbol_id' => $arbolId,
        ]);

SELECT `arboles`.*, `especies`.`nombre_comercial` AS `nombre_comercial`
FROM `amigo_arbol`
JOIN `arboles` ON `amigo_arbol`.`arbol_id` = `arboles`.`id`
JOIN `especies` ON `arboles`.`especie_id` = `especies`.`id`
WHERE `amigo_arbol`.`amigo_id` = '2'
---
    public function obtenerArbolesPorAmigo($amigo_id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table($this->table);
        $builder->select('arboles.*, especies.nombre_comercial AS nombre_comercial');
        $builder->join('arboles', 'amigo_arbol.arbol_id = arboles.id');
        $builder->join('especies', 'arboles.especie_id = especies.id');
        $builder->where('amigo_arbol.amigo_id', $amigo_id);

        return $builder->get()->getResultArray();

UPDATE `arboles` SET `estado` = 'Vendido'
WHERE `id` = '5'
---
    public function actualizarEstadoArbol($arbolId, $estado)
    {
        return $this->db->table('arboles')
            ->where('id', $arbolId)
            ->update(['estado' => $estado]);

SELECT `arboles`.*, `especies`.`nombre_comercial` AS `especie`
FROM `arboles`
JOIN `especies` ON `arboles`.`especie_id` = `especies`.`id`
WHERE `arboles`.`estado` = 'Disponible'
---
    public function obtenerArbolesDisponibles()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('arboles');
        $builder->select('arboles.*, especies.nombre_comercial AS especie');
        $builder->join('especies', 'arboles.especie_id = especies.id');
        $builder->where('arboles.estado', 'Disponible');

        return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `arboles`
WHERE `id` = '5'
AND `estado` = 'Disponible'
---
    public function verificarDisponibilidad($arbolId)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('arboles');
        $builder->where('id', $arbolId);
        $builder->where('estado', 'Disponible');

        return $builder->countAllResults() > 0; // Retorna true si está disponible